{"backend": "tensorflow", "config": [{"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 10, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "trainable": true, "padding": "same", "name": "conv2d_1", "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 20, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "padding": "same", "name": "conv2d_2", "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_2", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}