{"config": [{"config": {"bias_constraint": null, "dtype": "float32", "trainable": true, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 500, "bias_regularizer": null, "batch_input_shape": [null, 784], "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 250, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 10, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_3"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}